[
  {
    "image": "https://i.ibb.co.com/kYNfPd3/whatsApp.jpg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms",
    "id": 1,
    "description": "WhatsApp Messenger is one of the most widely used communication platforms across the globe, enabling users to send instant text messages, voice messages, images, videos, and documents seamlessly over the internet. It provides secure end-to-end encryption, ensuring that only you and the recipient can read what is sent. WhatsApp also allows high-quality voice and video calls, making it a powerful tool for personal and business communication. With its intuitive design, users can create group chats, share real-time locations, and update their statuses easily. It supports cross-platform functionality, allowing users to communicate across Android, iOS, and web devices effortlessly. The app continues to innovate with new privacy options, multi-device support, and community features that bring people closer together without compromising safety and simplicity.",
    "size": 45.6,
    "reviews": "12M",
    "ratingAvg": 4.7,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7dmmxbF4/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "id": 2,
    "description": "Facebook is a global social networking application designed to help people connect, share, and communicate with friends, family, and communities worldwide. Users can post photos, videos, and status updates, as well as follow pages, join groups, and engage with content tailored to their interests. The app provides real-time notifications, event planning tools, and a powerful marketplace feature for local buying and selling. Facebook prioritizes personalization by curating your news feed based on your interactions and interests, ensuring an engaging experience every time you open the app. With features like Stories, Reels, and Watch, Facebook blends entertainment with meaningful connection. It also integrates seamlessly with Messenger for private communication and supports account-level privacy controls to protect user data and online activity.",
    "size": 60.2,
    "reviews": "9M",
    "ratingAvg": 4.5,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cXQstV0k/Instagram.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 3,
    "description": "Instagram is a visual storytelling platform that enables users to share photos, short videos, and creative reels with a global audience. It encourages authentic connection through likes, comments, and direct messages. Businesses and creators use Instagram to build communities, promote brands, and engage followers through interactive features like polls, stickers, and live streaming. With personalized feeds and explore pages powered by smart algorithms, users discover content that aligns with their interests. Instagram also supports professional tools for creators, including insights, ad promotions, and monetization options. Its clean, minimal interface makes it easy to capture, edit, and share moments. From influencers to everyday users, Instagram continues to shape online culture by blending creativity, connection, and commerce seamlessly.",
    "size": 55.1,
    "reviews": "8M",
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/n8Lczkzt/YouTube.png",
    "title": "YouTube",
    "companyName": "Google",
    "id": 4,
    "description": "YouTube is the world’s leading video platform, empowering creators to share educational, entertaining, and inspiring content with billions of viewers. It supports channels, playlists, and subscriptions for easy organization and discovery of content. Users can like, comment, and share videos, while creators can earn through ads, memberships, and sponsorships. YouTube offers both free and premium experiences, including ad-free playback, offline downloads, and background audio. With YouTube Shorts, creators can publish bite-sized vertical videos that reach global audiences quickly. The platform also personalizes recommendations using AI to match user interests. Whether you’re learning new skills, exploring music, or enjoying entertainment, YouTube remains a central hub for digital media engagement and creativity worldwide.",
    "size": 75.4,
    "reviews": "15M",
    "ratingAvg": 4.8,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YTqV73Tc/Messenger.jpg",
    "title": "Messenger",
    "companyName": "Meta Platforms",
    "id": 5,
    "description": "Messenger is Meta’s fast, reliable chat platform designed for instant communication between friends, family, and businesses. It supports text messaging, group chats, voice and video calls, as well as file and media sharing. Messenger integrates with Facebook for seamless social connectivity while functioning as a standalone app. Users can personalize conversations with reactions, stickers, and themes, making chats more expressive. The app provides end-to-end encryption for private conversations and supports multi-device syncing, so you can stay connected anywhere. With features like message scheduling, disappearing mode, and chat customization, Messenger enhances everyday interactions and collaboration. It’s also used widely for business inquiries through Facebook Pages and Instagram, making communication smoother and smarter.",
    "size": 50.3,
    "reviews": "7M",
    "ratingAvg": 4.4,
    "downloads": 2.5,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TMYsLS1P/Snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Snapchat is a multimedia messaging app designed to make communication fun and fleeting. Users can send photos, short videos, and messages that disappear after being viewed, adding spontaneity and privacy to digital conversations. With creative filters, lenses, and AR effects, Snapchat allows users to express themselves visually. The app’s Discover section highlights content from creators, media companies, and influencers. Snap Map lets friends share real-time locations, while Memories provides a personal archive of saved Snaps. The app’s innovative Streak feature encourages daily interaction, building consistent engagement among users. Businesses use Snapchat Ads and Spotlight to reach younger audiences creatively. With a focus on authenticity, creativity, and self-expression, Snapchat continues to redefine how people interact socially in the mobile era.",
    "size": 65.0,
    "reviews": "4.2M",
    "ratingAvg": 4.3,
    "downloads": 2,
    "ratings": [
      { "name": "1 star", "count": 220000 },
      { "name": "2 star", "count": 85000 },
      { "name": "3 star", "count": 260000 },
      { "name": "4 star", "count": 1100000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LXj7p5BF/TikTok.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 7,
    "description": "TikTok is the leading short-form video platform that empowers users to create, share, and discover engaging content in just seconds. The app offers a vast library of music, effects, and filters that fuel creativity and entertainment. TikTok’s algorithm tailors content recommendations to individual user preferences, creating a highly addictive and personalized experience. From dance challenges to educational tutorials, it connects communities worldwide through trends and culture. Creators can live stream, collaborate through duets, and engage directly with followers. Businesses and influencers utilize TikTok for marketing, leveraging its viral potential and massive audience. With in-app editing tools, interactive comments, and analytics for creators, TikTok remains the go-to platform for creativity, discovery, and expression among millions of users across all demographics.",
    "size": 70.2,
    "reviews": "13M",
    "ratingAvg": 4.7,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 450000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jvyP9GBB/Spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 8,
    "description": "Spotify is a music and podcast streaming service that provides access to millions of songs, playlists, and shows from around the world. Users can explore music by mood, genre, or artist and create personalized playlists. Spotify’s recommendation engine learns from listening habits to deliver a customized experience with daily mixes and curated discoveries. Premium subscribers enjoy ad-free listening, offline downloads, and high-quality audio streaming. Podcasters use Spotify as a global distribution platform, reaching diverse audiences. The app also integrates with smart speakers, cars, and wearable devices for seamless playback. With social features like collaborative playlists and real-time listening with friends, Spotify connects people through the shared experience of sound and storytelling.",
    "size": 85.6,
    "reviews": "9M",
    "ratingAvg": 4.6,
    "downloads": 1.5,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mrb1WkpP/Netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 9,
    "description": "Netflix is a global streaming service offering a vast collection of movies, TV shows, documentaries, and original content available on demand. Users can watch anytime, anywhere on multiple devices, with personalized recommendations based on viewing preferences. The platform features award-winning originals such as Stranger Things, The Witcher, and Money Heist, setting industry standards for storytelling. Subscribers can download content for offline viewing and create separate profiles for family members. Netflix’s adaptive streaming ensures smooth playback even on slow connections. It continuously innovates with interactive experiences and diverse content libraries in multiple languages. As one of the pioneers in digital entertainment, Netflix remains synonymous with high-quality streaming and cinematic excellence worldwide.",
    "size": 95.3,
    "reviews": "5M",
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/V0J9rTWq/Snapseed.png",
    "title": "Snapseed",
    "companyName": "Google",
    "id": 10,
    "description": "Snapseed is a professional-grade photo editing application developed by Google, offering powerful tools and intuitive controls for photographers and hobbyists alike. It features over 25 editing tools, including selective adjustments, curves, healing, and perspective correction. The app supports RAW image editing, allowing advanced users to fine-tune exposure and color balance. Snapseed’s clean interface enables users to create high-quality edits quickly without complex workflows. With filter stacks and history tracking, every edit remains non-destructive and reversible. The app also includes one-tap enhancements for quick improvements. Its precise control, advanced filters, and reliability make it a top choice among creators seeking quality image adjustments directly from their smartphones.",
    "size": 45.0,
    "reviews": "2M",
    "ratingAvg": 4.8,
    "downloads": 0.5,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/svVkCddG/Gmail.png",
    "title": "Gmail",
    "companyName": "Google",
    "id": 11,
    "description": "Gmail is Google’s widely trusted email platform that combines simplicity, security, and productivity. It provides smart inbox management, automatically categorizing emails into primary, social, and promotional tabs. Gmail integrates seamlessly with Google Workspace tools such as Drive, Calendar, and Meet for streamlined workflow. Its AI-powered Smart Compose and Smart Reply features help users write faster and more efficiently. The app also includes built-in spam protection, phishing alerts, and robust encryption for secure communication. Users can easily manage multiple accounts, search emails instantly, and schedule messages. Whether for personal or professional use, Gmail remains an essential tool for modern communication and collaboration across devices.",
    "size": 30.4,
    "reviews": "3M",
    "ratingAvg": 4.7,
    "downloads": 2,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 2400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwb0rYnC/Google-Maps.png",
    "title": "Google Maps",
    "companyName": "Google",
    "id": 12,
    "description": "Google Maps is a comprehensive navigation and mapping tool that helps users explore the world with accurate real-time data. It offers driving, cycling, walking, and public transit directions with live traffic updates. Users can discover nearby restaurants, landmarks, and businesses through detailed listings and reviews. Street View and satellite imagery provide immersive exploration experiences. Google Maps also supports offline navigation and integrates with Google Assistant for hands-free guidance. Businesses leverage Maps to enhance visibility and attract local customers. With continuous updates and AI-driven improvements, Google Maps remains the go-to tool for reliable navigation, trip planning, and geographic discovery across devices globally.",
    "size": 65.7,
    "reviews": "6M",
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 4300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mCq992zm/Uber.png",
    "title": "Uber",
    "companyName": "Uber Technologies",
    "id": 13,
    "description": "Uber is a revolutionary ride-hailing platform connecting passengers with drivers through a seamless, easy-to-use mobile app. It provides real-time tracking, transparent pricing, and cashless payments for convenience and safety. Users can choose from multiple ride options, including economy, premium, and carpool. Uber’s rating system ensures quality service, while its safety features, such as trip sharing and emergency assistance, provide peace of mind. The platform also supports Uber Eats for food delivery, broadening its service ecosystem. With operations in over 10,000 cities globally, Uber continues to innovate urban mobility and transform the way people move, commute, and interact with their surroundings.",
    "size": 90.5,
    "reviews": "4M",
    "ratingAvg": 4.4,
    "downloads": 1.2,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 3400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N2kS0csX/Airbnb.jpg",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 14,
    "description": "Airbnb is a global platform that allows users to book unique accommodations and experiences in more than 200 countries. It connects travelers with hosts offering everything from private rooms to entire homes. The platform fosters authentic local experiences, empowering communities and promoting sustainable tourism. With user reviews, secure payments, and 24/7 customer support, Airbnb prioritizes trust and safety. Hosts can manage listings easily and earn extra income while sharing their space. The app’s Explore feature helps travelers discover new destinations, while curated experiences showcase local culture. Airbnb continues to redefine travel by emphasizing connection, affordability, and creativity in every stay.",
    "size": 80.2,
    "reviews": "2.5M",
    "ratingAvg": 4.7,
    "downloads": 0.7,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 2200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0R0GjxtW/LinkedIn.png",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 15,
    "description": "LinkedIn is the world’s largest professional networking platform, helping individuals build careers, connect with industry leaders, and discover opportunities. Users can showcase their skills, experience, and achievements through personalized profiles. Businesses use LinkedIn to post jobs, recruit talent, and share company updates. The platform also serves as a hub for thought leadership and professional development, offering articles, learning courses, and networking events. With its clean design and powerful analytics, LinkedIn enhances visibility for both professionals and brands. It encourages authentic connections that lead to real-world collaboration, career growth, and knowledge exchange across industries worldwide.",
    "size": 70.4,
    "reviews": "3.1M",
    "ratingAvg": 4.5,
    "downloads": 0.8,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 7300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TDRv8y1V/Spotify-Lite.png",
    "title": "Spotify Lite",
    "companyName": "Spotify AB",
    "id": 16,
    "description": "Spotify Lite is a streamlined version of the world’s leading music streaming app, designed specifically for users with limited data plans or low-end devices. Despite its lightweight size, it offers access to millions of songs, playlists, and podcasts from Spotify’s global library. The app provides quick loading times, reduced storage usage, and optimized performance, even on slower networks. With simple navigation, users can explore their favorite genres, discover new artists, and manage their listening habits easily. Spotify Lite includes a data monitoring feature that helps users track consumption and control streaming quality. Perfect for users seeking a smooth experience without sacrificing music discovery, Spotify Lite delivers the essence of Spotify in a compact, efficient package that performs exceptionally across regions with bandwidth constraints.",
    "size": 15.0,
    "reviews": "500K",
    "ratingAvg": 4.4,
    "downloads": 0.3,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/NntF8shF/Zoom-Cloud-Meetings.jpg",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications",
    "id": 17,
    "description": "Zoom Cloud Meetings revolutionized virtual communication by offering a reliable, high-quality video conferencing platform for businesses, educators, and individuals worldwide. It supports HD video, clear audio, screen sharing, breakout rooms, and interactive chat—all accessible with a simple interface. Whether hosting small team discussions or large webinars, Zoom ensures seamless connectivity and collaboration. Its cross-platform compatibility makes it easy to join meetings from mobile, desktop, or browser. Users can record sessions, share files, and integrate calendars for scheduling. The app also includes robust security features like end-to-end encryption and meeting locks. From remote learning to corporate boardrooms, Zoom empowers people to connect and work efficiently from anywhere, making it one of the most essential communication tools of the modern era.",
    "size": 120.0,
    "reviews": "5M",
    "ratingAvg": 4.6,
    "downloads": 0.8,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 4350000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rf7VSsSS/Twitter.png",
    "title": "Twitter",
    "companyName": "X Corp.",
    "id": 18,
    "description": "Twitter, now operated under X Corp., is a global platform for real-time news, social conversation, and community engagement. It enables users to share short posts known as tweets, engage in trending discussions, and follow topics ranging from politics to pop culture. The platform’s strength lies in its immediacy—breaking news often appears on Twitter first. Users can post text, images, videos, and polls while interacting through likes, retweets, and replies. With features like Spaces for live audio discussions and Communities for niche groups, Twitter continues to evolve beyond microblogging. Verified accounts, curated trends, and content personalization help users stay informed and connected. Whether for personal expression, brand building, or following global movements, Twitter remains an influential hub of public conversation.",
    "size": 50.7,
    "reviews": "4M",
    "ratingAvg": 4.2,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 2900000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LhHCTGpf/Gmail-Go.jpg",
    "title": "Gmail Go",
    "companyName": "Google",
    "id": 19,
    "description": "Gmail Go is the lightweight, efficient version of Gmail, built for Android devices with limited memory and slower internet connections. Despite its compact size, it provides all essential email features—real-time notifications, smart categorization, and powerful spam protection. The app consumes less mobile data and storage while ensuring a smooth and responsive experience. Users can easily manage multiple accounts, send attachments, and use offline mode for reading messages. Its minimal design helps focus on communication without distractions. Backed by Google’s security infrastructure, Gmail Go protects users against phishing and unwanted emails. Ideal for emerging markets and budget smartphones, Gmail Go delivers fast, secure, and reliable email management in an optimized and user-friendly form.",
    "size": 10.5,
    "reviews": "200K",
    "ratingAvg": 4.3,
    "downloads": 1.5,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mjD88tM/Twitter-Lite.jpg",
    "title": "Twitter Lite",
    "companyName": "X Corp.",
    "id": 20,
    "description": "Twitter Lite is a data-friendly version of Twitter, optimized for fast performance on slow or unstable networks. It provides all essential features—posting tweets, browsing timelines, and engaging with followers—while using up to 70% less data. The app loads quickly, even on 2G or 3G connections, and occupies minimal storage space. Users can switch to data saver mode to control image and video downloads. Despite its lightweight build, Twitter Lite maintains real-time updates, notifications, and trending topics. It’s particularly effective in regions with limited bandwidth or devices with lower hardware specifications. By combining speed, simplicity, and efficiency, Twitter Lite ensures that millions can join global conversations without sacrificing connectivity or performance.",
    "size": 8.7,
    "reviews": "150K",
    "ratingAvg": 4.1,
    "downloads": 1.2,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 111000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8ntMYwx3/Google-Drive.png",
    "title": "Google Drive",
    "companyName": "Google",
    "id": 21,
    "description": "Google Drive is a secure cloud storage solution that allows users to store, share, and collaborate on files from anywhere. It integrates seamlessly with Google Docs, Sheets, and Slides, making it a cornerstone of productivity for individuals and teams. Drive supports file uploads of various formats and provides easy sharing options with customizable permissions. Its advanced search and AI features help locate files instantly. Users benefit from automatic syncing across devices and real-time collaboration tools. With tight security, encrypted access, and backup features, Google Drive ensures both accessibility and safety. Whether for personal use or business operations, it simplifies file management in the digital workspace.",
    "size": 100.4,
    "reviews": "3M",
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 2750000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZc18vBx/Microsoft-Teams.jpg",
    "title": "Microsoft Teams",
    "companyName": "Microsoft",
    "id": 22,
    "description": "Microsoft Teams is an all-in-one collaboration platform that unites chat, meetings, calls, and file sharing in a single workspace. It enables seamless teamwork, supporting remote and hybrid work environments. Users can create channels, collaborate on Office documents in real time, and organize projects with task management tools. Teams integrates with Microsoft 365, enhancing productivity across Word, Excel, and PowerPoint. Features like breakout rooms, meeting recording, and background effects make virtual communication engaging and effective. Advanced security protocols ensure enterprise-level protection for users. Whether used for business, education, or community collaboration, Microsoft Teams remains one of the most reliable and comprehensive tools for modern digital communication.",
    "size": 150.0,
    "reviews": "2.5M",
    "ratingAvg": 4.4,
    "downloads": 0.5,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 2200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TD0p5Kcq/Discord.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 23,
    "description": "Discord is a powerful communication platform for communities, gamers, and professionals. It combines voice, video, and text chat within organized servers, allowing users to build spaces for discussions, collaboration, or fun. With low-latency voice channels and high-quality video, Discord ensures smooth interactions. It supports file sharing, bots, and integrations with platforms like Twitch and Spotify. Communities can be public or private, each customizable with roles and permissions. Discord also includes streaming capabilities, making it a hub for both social and professional communication. Its flexibility, privacy controls, and vibrant culture make it the go-to app for online communities of every kind.",
    "size": 85.0,
    "reviews": "3M",
    "ratingAvg": 4.7,
    "downloads": 0.4,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/k2Fw7wX6/Slack.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 24,
    "description": "Slack is a cloud-based collaboration platform that enhances workplace communication through organized channels, direct messaging, and app integrations. It replaces email clutter with real-time conversations and searchable history. Teams can share files, conduct voice or video calls, and integrate tools like Google Drive, Trello, and Asana for improved productivity. Slack’s customizable notifications and workflow automations streamline daily operations. Its intuitive interface encourages transparency and teamwork, especially in remote and hybrid setups. With enterprise-grade security and scalability, Slack caters to businesses of all sizes. It has become a vital digital hub for communication, ensuring teams stay aligned, connected, and efficient across projects and time zones.",
    "size": 75.6,
    "reviews": "1.8M",
    "ratingAvg": 4.5,
    "downloads": 0.3,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ycMtTtLd/Telegram.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 25,
    "description": "Telegram is a cloud-based instant messaging app known for speed, security, and reliability. It offers encrypted chats, large file sharing, and group channels supporting up to 200,000 members. Users can sync messages seamlessly across devices and store unlimited media in the cloud. Telegram’s bots, stickers, and themes enhance engagement, while features like Secret Chats and self-destructing messages prioritize privacy. The app also supports voice and video calls with crisp quality. Developers can create APIs and mini-apps within Telegram, expanding its ecosystem. Free of ads and open-source at its core, Telegram champions communication freedom and privacy while serving millions of users globally.",
    "size": 65.0,
    "reviews": "5M",
    "ratingAvg": 4.8,
    "downloads": 0.8,
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 4700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rKKHnKBj/Microsoft-Office.png",
    "title": "Microsoft Office",
    "companyName": "Microsoft",
    "id": 26,
    "description": "Microsoft Office unifies productivity tools like Word, Excel, and PowerPoint into one powerful mobile application. It enables users to create, edit, and share documents on the go, with seamless cloud integration through OneDrive. The app offers templates, scanning features, and PDF conversion, making it an all-in-one solution for professionals and students alike. With AI-powered suggestions and compatibility across platforms, Office ensures efficiency and accessibility. Users can collaborate in real time, track changes, and work offline when needed. Whether drafting reports or preparing presentations, Microsoft Office remains an indispensable tool for productivity, creativity, and organization in today’s fast-paced digital world.",
    "size": 145.0,
    "reviews": "2M",
    "ratingAvg": 4.4,
    "downloads": 0.4,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 1750000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/QFSZSs1Q/Gboard.jpg",
    "title": "Gboard",
    "companyName": "Google",
    "id": 27,
    "description": "Gboard is Google’s intelligent keyboard app, offering fast typing, built-in search, and seamless multilingual support. It features Glide Typing, voice input, emoji predictions, and integrated Google Translate for effortless communication. The app’s smart suggestions adapt to user habits, ensuring personalized typing efficiency. Users can access GIFs, stickers, and clipboard history instantly. Gboard supports hundreds of languages and works offline for basic input. Its privacy-first approach ensures user data remains secure. From casual messaging to professional writing, Gboard enhances every keystroke with precision, convenience, and intelligence, making it the ultimate choice for modern smartphone users worldwide.",
    "size": 30.0,
    "reviews": "2.5M",
    "ratingAvg": 4.6,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZrLKXPp/Google-Books.png",
    "title": "Google Books",
    "companyName": "Google",
    "id": 28,
    "description": "Google Books provides a massive digital library where readers can explore millions of e-books and audiobooks across genres. Users can preview, purchase, or download books for offline reading with adjustable fonts and dark mode for comfort. Syncing with a Google account ensures reading progress and notes are saved across devices. The app also supports highlighting, bookmarks, and text-to-speech functionality. With curated collections and personalized recommendations, Google Books simplifies discovering new authors and topics. Its integration with Google Play enables seamless transactions and cloud backup. Whether for leisure reading or research, Google Books delivers an accessible and enjoyable literary experience for every reader.",
    "size": 40.5,
    "reviews": "1M",
    "ratingAvg": 4.3,
    "downloads": 0.5,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 950000 }
    ]
  }
]
